// გააკეთეთ უნივერსიტეტების აპლიკაცია სადაც გექნებათ რამდენიმე page

// მთავარ გვერდზე გამოიტანეთ ინტერფეისი სადაც გეწერებათ რომ ეს არის უნივერსიტეტების
// გვერდი და შეგიძლიათ გაიგოთ ინფორმაცია სასურველი უნივერსიტეტის შესახებ.

// მომხმარებელმა უნდა შეიყვანოს ქვეყნის სახელი რომელი ქვეყნის უნივერსიტეტებიც აინტერესებს
// და ღილაკზე დაჭერის შემდეგ უნდა გადავიდეს ახალ გვერდზე სადაც იქნება არჩეული ქვეყნის ყველა უნივერსიტეტი

// თუ რომელიმე კონკრეტულად აინტერესებს ამისთვის უნდა იყოს ღილაკი (Detail page) რომელზე დაჭერის შემთხვევაშიც
// უნდა გადავიდეს კონკრეტულად არჩეული უნივერსიტეტის გვერდზე სადაც ეწერება უფრო მეტი ინფორმაცია კონკრეტულ უნივერსიტეტზე.

// უნივერსიტეტების ინფორმაციის წამოსაღებად გამოიყენეთ მოცემული API

// http://universities.hipolabs.com/

// სასურველი ქვეყნის უნივერსიტეტების სანახავად შეგიძლიათ გადასცეთ პარამეტრი
// მაგ:
// http://universities.hipolabs.com/search?country=Georgia
