// გააკეთეთ აპლიკაცია სადაც გექნებათ 2 ინფუთი მომხმარებელმა რომ შეძლოს იმეილის და პაროლის შეყვანა
// და 1 ღილაკი რომელზე დაჭერის შემთხვევაშიც მომხმარებელი ნახავს თქვენს ძირითად საიტს.

// როგორც წინა დავალებაში გავაკეთეთ

// შევთანხმდეთ რომ
// იმეილი იყოს digitalAcademy@gmail.com
// პაროლი iLoveReact123

// მომხმარებელი თუ სწორად შეიყვანს იმეილს და პაროლს მხოლოდ ამ შემთხვევაში შეძლოს ღილაკზე დაჭერა
// სხვა შემთხვევაში ღილაკზე დაჭერა არ უნდა შეგვეძლოს

// გაარჩიეთ მოცემული აპი დოკუმენტაცია და წამოიღეთ საჭირო ინფორმაცია

// API DOC
// https://randomuser.me/documentation#howto

// ძირითად გვერდზე უნდა იყოს ინფორმაცია დახატული რომელსაც წამოიღებთ api დან
// დახატეთ თქვენთვის სასურველი ფროფერთიები.

// საწყისად დახატეთ 5 მომხმარებელი და გააკეთეთ ღილაკი რომელზე დაჭერის შემთხვევაშიც
// დახატავს კიდევ ერთ მომხმარებელს (რამდენჯერაც დავაჭერ იმდენჯერ დახატავს ახალ მომხმარებელს.)

// გაუკეთეთ რამდენიმე ფილტრი რომ შემეძლოს მხოლოდ ჩემთვის სასურველი ფროფერთიების ნახვა
// მაგალითად თუ მოვნიშნავ მხოლოდ სახელს და იმეილს დახატოს მომხმარებლის ქარდი სადაც იქნება მხოლოდ იმეილი და სახელი
