// გააკეთეთ აპლიკაცია სადაც მთავარ გვერდზე მოთხოვთ მომხმარებელს რომ შეიყვანოს იმეილი და პაროლი
// პროგრამაში დასალოგინებლად (თავიდან ავიღოთ რომ მეილი იყოს random@gmail.com და პაროლი random123)

// პროგრამაში დალოგინების შემდეგ მომხმარებელმა უნდა დაინახოს გასაყიდი პროდუქტები რომლებიც
// უნდა წამოიღოთ შემდეგი API-დან

// https://dummyjson.com/products

// საწყის ეტაპზე დახატეთ მხოლოდ 10 პროდუქტი

// challenge 1
// დაამატეთ პაგინაციის ფუნქციონალი რისთვისაც შეგიძლიათ გამოიყენოთ მოცემული ლინკი.
// https://dummyjson.com/products?limit=10&skip=10

// challenge 2
// დაამატეთ Cart რათა მომხმარებელმა შეძლოს პროდუქტების Cart-ში დამატება.

// challenge 3

// დაამატეთ მომხმარებლის დარეგისტრირების ფუნქციონალი
// მომხმარებელმა პროგრამაში შესვლა შეძლოს მხოლოდ დარეგისტრირებული email და პაროლით.
